; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v3 ?v9)
             (pred_4 ?v6 ?v12)
             (pred_5 ?v3 ?v12)
             (pred_1 ?v10 ?v3 )
	     (pred_12 ?v3)
             (pred_11 ?v11)
             (pred_2 ?v6)
             (pred_7 ?v12)
             (pred_3 ?v3)
             (pred_9 ?v6)
             (pred_10 ?v3)
             (pred_8 ))



(:action op_3
:parameters (?v13 ?v8 ?v2 ?v1)
:precondition (and (pred_11 ?v13) (pred_11 ?v8) (pred_2 ?v2) (pred_7 ?v1)
          (pred_6 ?v13 ?v8) (pred_4 ?v2 ?v1)
                   (pred_5 ?v8 ?v1) (pred_12 ?v13) 
                   (pred_3 ?v8) (pred_9 ?v2))
:effect (and  (pred_10 ?v8) (not (pred_3 ?v8))))


(:action op_5
:parameters (?v13 ?v7)
:precondition (and (pred_11 ?v13) (pred_11 ?v7)
               (pred_12 ?v13) (pred_6 ?v13 ?v7) (pred_10 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v13))))

(:action op_1
:parameters (?v13 ?v2)
:precondition (and (pred_11 ?v13) (pred_2 ?v2) 
                  (pred_12 ?v13) (pred_1 ?v2 ?v13) (pred_8 ))
:effect (and (pred_9 ?v2)
   (not (pred_1 ?v2 ?v13)) (not (pred_8 ))))


(:action op_2
:parameters (?v13 ?v4 ?v5)
:precondition (and (pred_11 ?v13) (pred_2 ?v4) (pred_2 ?v5)
                  (pred_12 ?v13) (pred_9 ?v5) (pred_1 ?v4 ?v13))
:effect (and (pred_9 ?v4) (pred_1 ?v5 ?v13)
        (not (pred_9 ?v5)) (not (pred_1 ?v4 ?v13))))

(:action op_4
:parameters (?v13 ?v2)
:precondition (and (pred_11 ?v13) (pred_2 ?v2) 
                  (pred_12 ?v13) (pred_9 ?v2))
:effect (and (pred_8 ) (pred_1 ?v2 ?v13) (not (pred_9 ?v2)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_20 obj_31 obj_07 obj_23 obj_21 obj_29 obj_24 obj_19 obj_22 obj_32 obj_18 obj_11 obj_26 obj_28 obj_05 obj_03 obj_02 obj_09 obj_30 obj_06 obj_13 obj_12 obj_15 obj_14
    obj_01 obj_25 obj_16
    obj_17 obj_27 obj_10 obj_08
    )

    (:init
       (pred_8)

       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_31)
       (pred_11 obj_07)
       (pred_11 obj_23)
       (pred_11 obj_21)
       (pred_11 obj_29)
       (pred_11 obj_24)
       (pred_11 obj_19)
       (pred_11 obj_22)
       (pred_11 obj_32)
       (pred_11 obj_18)
       (pred_11 obj_11)
       (pred_11 obj_26)
       (pred_11 obj_28)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_30)
       (pred_11 obj_06)
       (pred_11 obj_13)
       (pred_11 obj_12)
       (pred_11 obj_15)
       (pred_11 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_25)
       (pred_7 obj_16)
       (pred_2 obj_17)
       (pred_2 obj_27)
       (pred_2 obj_10)
       (pred_2 obj_08)

       (pred_6 obj_04 obj_21)
       (pred_6 obj_04 obj_20)
       (pred_6 obj_20 obj_29)
       (pred_6 obj_20 obj_31)
       (pred_6 obj_20 obj_04)
       (pred_6 obj_31 obj_24)
       (pred_6 obj_31 obj_07)
       (pred_6 obj_31 obj_20)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_07 obj_23)
       (pred_6 obj_07 obj_31)
       (pred_6 obj_23 obj_22)
       (pred_6 obj_23 obj_07)
       (pred_6 obj_21 obj_32)
       (pred_6 obj_21 obj_29)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_29 obj_18)
       (pred_6 obj_29 obj_24)
       (pred_6 obj_29 obj_20)
       (pred_6 obj_29 obj_21)
       (pred_6 obj_24 obj_11)
       (pred_6 obj_24 obj_19)
       (pred_6 obj_24 obj_31)
       (pred_6 obj_24 obj_29)
       (pred_6 obj_19 obj_26)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_24)
       (pred_6 obj_22 obj_28)
       (pred_6 obj_22 obj_23)
       (pred_6 obj_22 obj_19)
       (pred_6 obj_32 obj_05)
       (pred_6 obj_32 obj_18)
       (pred_6 obj_32 obj_21)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_18 obj_11)
       (pred_6 obj_18 obj_29)
       (pred_6 obj_18 obj_32)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_11 obj_26)
       (pred_6 obj_11 obj_24)
       (pred_6 obj_11 obj_18)
       (pred_6 obj_26 obj_09)
       (pred_6 obj_26 obj_28)
       (pred_6 obj_26 obj_19)
       (pred_6 obj_26 obj_11)
       (pred_6 obj_28 obj_30)
       (pred_6 obj_28 obj_22)
       (pred_6 obj_28 obj_26)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_32)
       (pred_6 obj_03 obj_13)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_30)
       (pred_6 obj_09 obj_26)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_30 obj_14)
       (pred_6 obj_30 obj_28)
       (pred_6 obj_30 obj_09)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_03)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_14 obj_30)
       (pred_6 obj_14 obj_15)
       (pred_3 obj_15)
       (pred_3 obj_04)
       (pred_3 obj_05)
       (pred_3 obj_03)
       (pred_5  obj_15 obj_01)
       (pred_5  obj_04 obj_25)
       (pred_5  obj_05 obj_16)
       (pred_5  obj_03 obj_25)
       (pred_10 obj_20)
       (pred_10 obj_31)
       (pred_10 obj_07)
       (pred_10 obj_23)
       (pred_10 obj_21)
       (pred_10 obj_29)
       (pred_10 obj_24)
       (pred_10 obj_19)
       (pred_10 obj_22)
       (pred_10 obj_32)
       (pred_10 obj_18)
       (pred_10 obj_11)
       (pred_10 obj_26)
       (pred_10 obj_28)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_30)
       (pred_10 obj_06)
       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_14)

       (pred_4  obj_17 obj_01)
       (pred_4  obj_27 obj_25)
       (pred_4  obj_10 obj_16)
       (pred_4  obj_08 obj_16)
       (pred_1 obj_17 obj_31)
       (pred_1 obj_27 obj_20)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_08 obj_18)
       (pred_12 obj_28)
    )

    (:goal (and
       (pred_1 obj_17 obj_19)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_08 obj_19)
    ))
(:constraints
  (always (not (pred_12 obj_11)))
)
)

; plan
1. (op_5 obj_28 obj_26)
   deleted: (pred_12 obj_28)
   added: (pred_12 obj_26)
   goals met: 0 of 3
2. (op_5 obj_26 obj_09)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_09)
   goals met: 0 of 3
3. (op_5 obj_09 obj_02)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_02)
   goals met: 0 of 3
4. (op_1 obj_02 obj_10)
   deleted: (pred_1 obj_10 obj_02) (pred_8)
   added: (pred_9 obj_10)
   goals met: 0 of 3
5. (op_5 obj_02 obj_09)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_09)
   goals met: 0 of 3
6. (op_5 obj_09 obj_26)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_26)
   goals met: 0 of 3
7. (op_5 obj_26 obj_19)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_19)
   goals met: 0 of 3
8. (op_5 obj_19 obj_24)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_24)
   goals met: 0 of 3
9. (op_5 obj_24 obj_29)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_29)
   goals met: 0 of 3
10. (op_5 obj_29 obj_18)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_18)
   goals met: 0 of 3
11. (op_2 obj_18 obj_08 obj_10)
   deleted: (pred_9 obj_10) (pred_1 obj_08 obj_18)
   added: (pred_9 obj_08) (pred_1 obj_10 obj_18)
   goals met: 1 of 3
12. (op_5 obj_18 obj_29)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_29)
   goals met: 1 of 3
13. (op_5 obj_29 obj_24)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_24)
   goals met: 1 of 3
14. (op_5 obj_24 obj_19)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_19)
   goals met: 1 of 3
15. (op_4 obj_19 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_8) (pred_1 obj_08 obj_19)
   goals met: 2 of 3
16. (op_5 obj_19 obj_07)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_07)
   goals met: 2 of 3
17. (op_5 obj_07 obj_31)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_31)
   goals met: 2 of 3
18. (op_1 obj_31 obj_17)
   deleted: (pred_1 obj_17 obj_31) (pred_8)
   added: (pred_9 obj_17)
   goals met: 2 of 3
19. (op_5 obj_31 obj_07)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_07)
   goals met: 2 of 3
20. (op_5 obj_07 obj_19)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_19)
   goals met: 2 of 3
21. (op_4 obj_19 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_8) (pred_1 obj_17 obj_19)
   goals met: 3 of 3
